def main():
    pikachu = {
        "name": "ピカチュウ",
        "hp": 20,
        "atk": {
            "10万ボルト": 10
        }
    }
    hitokage = {
        "name": "ヒトカゲ",
        "hp": 18,
        "atk": {
            "ひのこ": 5
        }
    }
    
    
    print("TEST")

if __name__ in "__main__":
    main()

ex_output = """ピカチュウがあらわれた。ピカチュウのHPは20だ。
ヒトカゲがあらわれた。ヒトカゲのHPは18だ。
ピカチュウのこうげき！10万ボルト！ヒトカゲは10ダメージをもらった。ヒトカゲのHPは8だ。
ヒトカゲのこうげき！10万ボルト！ピカチュウは5ダメージをもらった。ピカチュウのHPは15だ。
ピカチュウのこうげき！10万ボルト！ヒトカゲは10ダメージをもらった。ヒトカゲのHPは0だ。
ヒトカゲはたおれた。ピカチュウのかち！
"""